## Production: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.notification-canada-ca-api-lambda-waf-logs will be destroyed
  # (because aws_cloudwatch_log_group.notification-canada-ca-api-lambda-waf-logs is not in configuration)
  - resource "aws_cloudwatch_log_group" "notification-canada-ca-api-lambda-waf-logs" {
      - arn               = "arn:aws:logs:ca-central-1:296255494825:log-group:aws-waf-logs-notification-canada-ca-api-lambda-waf" -> null
      - id                = "aws-waf-logs-notification-canada-ca-api-lambda-waf" -> null
      - name              = "aws-waf-logs-notification-canada-ca-api-lambda-waf" -> null
      - retention_in_days = 7 -> null
      - tags              = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null
      - tags_all          = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null
    }

  # aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs will be created
  + resource "aws_kinesis_firehose_delivery_stream" "firehose-api-lambda-waf-logs" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-notification-canada-ca-api-lambda-waf"
      + tags           = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-296255494825"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/296255494825/lambda/"
          + role_arn           = "arn:aws:iam::296255494825:role/FirehoseWafLogs"
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_wafv2_web_acl_logging_configuration.cloudwatch-api-lambda-waf-logs will be destroyed
  # (because aws_wafv2_web_acl_logging_configuration.cloudwatch-api-lambda-waf-logs is not in configuration)
  - resource "aws_wafv2_web_acl_logging_configuration" "cloudwatch-api-lambda-waf-logs" {
      - id                      = "arn:aws:wafv2:ca-central-1:296255494825:regional/webacl/api-lambda-waf/21faf60d-21e5-4308-b476-14a86832ed01" -> null
      - log_destination_configs = [
          - "arn:aws:logs:ca-central-1:296255494825:log-group:aws-waf-logs-notification-canada-ca-api-lambda-waf",
        ] -> null
      - resource_arn            = "arn:aws:wafv2:ca-central-1:296255494825:regional/webacl/api-lambda-waf/21faf60d-21e5-4308-b476-14a86832ed01" -> null

      - redacted_fields {

          - single_header {
              - name = "authorization" -> null
            }
        }
    }

  # aws_wafv2_web_acl_logging_configuration.firehose-api-lambda-waf-logs will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "firehose-api-lambda-waf-logs" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = "arn:aws:wafv2:ca-central-1:296255494825:regional/webacl/api-lambda-waf/21faf60d-21e5-4308-b476-14a86832ed01"

      + redacted_fields {

          + single_header {
              + name = "authorization"
            }
        }
    }

  # aws_wafv2_web_acl_logging_configuration.notification-canada-ca-api-lambda-waf-logs will be destroyed
  # (because aws_wafv2_web_acl_logging_configuration.notification-canada-ca-api-lambda-waf-logs is not in configuration)
  - resource "aws_wafv2_web_acl_logging_configuration" "notification-canada-ca-api-lambda-waf-logs" {
      - id                      = "arn:aws:wafv2:ca-central-1:296255494825:regional/webacl/api-lambda-waf/21faf60d-21e5-4308-b476-14a86832ed01" -> null
      - log_destination_configs = [
          - "arn:aws:logs:ca-central-1:296255494825:log-group:aws-waf-logs-notification-canada-ca-api-lambda-waf",
        ] -> null
      - resource_arn            = "arn:aws:wafv2:ca-central-1:296255494825:regional/webacl/api-lambda-waf/21faf60d-21e5-4308-b476-14a86832ed01" -> null

      - redacted_fields {

          - single_header {
              - name = "authorization" -> null
            }
        }
    }

Plan: 2 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.ecr-user-access-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

34 tests, 16 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
